app/controllers/sessions_controller.rb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."phone_number" = ? LIMIT ?  [["phone_number", "8904370081"], ["LIMIT", 1]]
---
  def create
    teacher = Teacher.find_by(phone_number: params[:phone_number])