app/controllers/students_controller.rb

SELECT "students".* FROM "students" WHERE "students"."teacher_id" = ?  [["teacher_id", 2]]
---
  def index
    @students = Student.where(teacher_id: session[:teacher_id])

SELECT "students".* FROM "students" WHERE "students"."name" = ? AND "students"."subject" = ? AND "students"."teacher_id" = ? LIMIT ?  [["name", "sagar"], ["subject", "Maths"], ["teacher_id", 2], ["LIMIT", 1]]
UPDATE "students" SET "marks" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["marks", 144], ["updated_at", "2024-09-20 09:11:13.212307"], ["id", 1]]
INSERT INTO "students" ("name", "subject", "marks", "teacher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "sagar"], ["subject", "Maths"], ["marks", 33], ["teacher_id", 2], ["created_at", "2024-09-20 09:10:30.858660"], ["updated_at", "2024-09-20 09:10:30.858660"]]
---
  def create
    existing_student = Student.find_by(name: student_params[:name], subject: student_params[:subject], teacher_id: session[:teacher_id])

    if existing_student
      # Update the existing student's marks
      existing_student.update(marks: existing_student.marks + student_params[:marks].to_i)
      redirect_to students_path, notice: 'Marks updated for existing student.'
    else
      @student = Student.new(student_params)
      @student.teacher_id = session[:teacher_id] # Associate with the teacher

      if @student.save

UPDATE "students" SET "subject" = ?, "marks" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["subject", "Science"], ["marks", 43], ["updated_at", "2024-09-20 15:28:35.599646"], ["id", 12]]
---
  def update
    if @student.update(student_params)

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
---
  def destroy
    if @student.destroy